tools/mutations/ai_set_stream_vol_left_wrong_shift.patch
diff --git a/src/sdk_port/ai/ai.c b/src/sdk_port/ai/ai.c
index 6328304..835aff9 100644
--- a/src/sdk_port/ai/ai.c
+++ b/src/sdk_port/ai/ai.c
@@ -72,7 +72,7 @@ uint32_t AIGetStreamPlayState(void)
 /* AISetStreamVolLeft (ai.c:187-190) */
 void AISetStreamVolLeft(uint8_t volume)
 {
-    gc_ai_regs[1] = (gc_ai_regs[1] & ~0xFFu) | ((uint32_t)volume & 0xFFu);
+    gc_ai_regs[1] = (gc_ai_regs[1] & ~0xFFu) | (((uint32_t)volume & 0xFFu) << 8);
 }
 
 /* AIGetStreamVolLeft (ai.c:192-195) */
