tools/mutations/ar_get_dma_status_const0.patch
diff --git a/src/sdk_port/ar/ar_hw.c b/src/sdk_port/ar/ar_hw.c
index 8fb86c7..91fcd50 100644
--- a/src/sdk_port/ar/ar_hw.c
+++ b/src/sdk_port/ar/ar_hw.c
@@ -28,7 +28,7 @@ void ARStartDMA(uint32_t type, uint32_t mainmem_addr, uint32_t aram_addr, uint32
 /* ARGetDMAStatus (ar.c:35-43) — Return 0 (idle). Real HW reads __DSPRegs[5] bit 9. */
 uint32_t ARGetDMAStatus(void)
 {
-    return gc_ar_dma_status;
+    return 0;
 }
 
 /* ARRegisterDMACallback (ar.c:24-33) — Swap callback pointer. */
