tools/mutations/ar_register_dma_callback_no_store.patch
diff --git a/src/sdk_port/ar/ar_hw.c b/src/sdk_port/ar/ar_hw.c
index 5ce3504..64001bb 100644
--- a/src/sdk_port/ar/ar_hw.c
+++ b/src/sdk_port/ar/ar_hw.c
@@ -37,7 +37,7 @@ ARCallback ARRegisterDMACallback(ARCallback callback)
 {
     ARCallback old = (ARCallback)gc_ar_callback_ptr;
-    gc_ar_callback_ptr = (uintptr_t)callback;
+    (void)callback;
     return old;
 }
