tools/mutations/card_get_serial_no_xor_bad_not.patch
diff --git a/src/sdk_port/card/CARDGetSerialNo.c b/src/sdk_port/card/CARDGetSerialNo.c
--- a/src/sdk_port/card/CARDGetSerialNo.c
+++ b/src/sdk_port/card/CARDGetSerialNo.c
@@ -32,7 +32,7 @@
         u64 piece = 0;
         u8* serial = (u8*)(uintptr_t)card->work_area + (u32)(u32)i * 8u;
 
         for (b = 0; b < 8; b++) {
-            piece = (piece << 8) | (u64)serial[b];
+            piece = (piece << 8) | (u64)(serial[b] ^ 0xFFu);
         }
         code ^= piece;
     }
