tools/mutations/card_mount_async_busy_check_inverted.patch
diff --git a/src/sdk_port/card/CARDMount.c b/src/sdk_port/card/CARDMount.c
--- a/src/sdk_port/card/CARDMount.c
+++ b/src/sdk_port/card/CARDMount.c
@@ -171,6 +171,6 @@ s32 CARDMountAsync(s32 chan, void* workArea, CARDCallback detachCallback, CARDCa
 
   enabled = OSDisableInterrupts();
-  if (card->result == CARD_RESULT_BUSY) {
+  if (card->result != CARD_RESULT_BUSY) {
     OSRestoreInterrupts(enabled);
     return CARD_RESULT_BUSY;
   }
