tools/mutations/card_mount_step0_unlock_branch_inverted.patch
diff --git a/src/sdk_port/card/CARDMount.c b/src/sdk_port/card/CARDMount.c
--- a/src/sdk_port/card/CARDMount.c
+++ b/src/sdk_port/card/CARDMount.c
@@ -209,3 +209,3 @@ static s32 DoMount(s32 chan) {
 
-    if ((status & 0x40u) == 0) {
+    if ((status & 0x40u) != 0) {
       result = __CARDUnlock(chan, card->id);
