tools/mutations/card_open_iBlock_plus1.patch
diff --git a/src/sdk_port/card/CARDOpen.c b/src/sdk_port/card/CARDOpen.c
index ccdd841..68a6386 100644
--- a/src/sdk_port/card/CARDOpen.c
+++ b/src/sdk_port/card/CARDOpen.c
@@ -67,7 +67,7 @@ s32 CARDOpen(int32_t chan, const char* fileName, CARDFileInfo* fileInfo) {
             fileInfo->chan = chan;
             fileInfo->fileNo = fileNo;
             fileInfo->offset = 0;
-            fileInfo->iBlock = startBlock;
+            fileInfo->iBlock = (u16)(startBlock + 1);
         }
         }
     }
