tools/mutations/card_read_off_in_sector_zero.patch
diff --git a/src/sdk_port/card/CARDRead.c b/src/sdk_port/card/CARDRead.c
--- a/src/sdk_port/card/CARDRead.c
+++ b/src/sdk_port/card/CARDRead.c
@@ -123,7 +123,7 @@ s32 CARDReadAsync(CARDFileInfo* fileInfo, void* buf, s32 length, s32 offset, CARDCallback callback)
     DCInvalidateRange(buf, (u32)length);
     card->api_callback = (uintptr_t)(callback ? callback : __CARDDefaultApiCallback);
 
-    s32 off_in_sector = (s32)offset_in((u32)fileInfo->offset, (u32)card->sector_size);
+    s32 off_in_sector = 0;
     s32 first_len = (length < (s32)card->sector_size - off_in_sector) ? length : (s32)card->sector_size - off_in_sector;
     result = __CARDRead(fileInfo->chan,
                         card->sector_size * (u32)fileInfo->iBlock + (u32)off_in_sector,
