tools/mutations/card_read_segment_wrong_cmd.patch
diff --git a/src/sdk_port/card/card_bios.c b/src/sdk_port/card/card_bios.c
--- a/src/sdk_port/card/card_bios.c
+++ b/src/sdk_port/card/card_bios.c
@@ -333,7 +333,7 @@ s32 __CARDReadSegment(s32 chan, CARDCallback callback)
     }
 
     card = &gc_card_block[chan];
-    card->cmd[0] = 0x52;
+    card->cmd[0] = 0x53;
     card->cmd[1] = AD1(card->addr);
     card->cmd[2] = AD2(card->addr);
     card->cmd[3] = AD3(card->addr);
