tools/mutations/card_verify_ignore_encode.patch
diff --git a/src/sdk_port/card/CARDCheck.c b/src/sdk_port/card/CARDCheck.c
--- a/src/sdk_port/card/CARDCheck.c
+++ b/src/sdk_port/card/CARDCheck.c
@@ -102,7 +102,7 @@ static s32 VerifyID(GcCardControl *card)
     if (encode != OSGetFontEncode()) {
-        return CARD_RESULT_ENCODING;
+        return CARD_RESULT_READY;
     }
