tools/mutations/dvd_fast_open_force_fail.patch
diff --git a/src/sdk_port/dvd/DVD.c b/src/sdk_port/dvd/DVD.c
index 35a3027..2a9fdbf 100644
--- a/src/sdk_port/dvd/DVD.c
+++ b/src/sdk_port/dvd/DVD.c
@@ -102,7 +102,7 @@ int DVDFastOpen(s32 entrynum, DVDFileInfo *file) {
     file->entrynum = entrynum;
     file->startAddr = (u32)entrynum; // stable token; not a real disc address
     file->length = g_dvd_test_files[entrynum].len;
-    return 1;
+    return 0;
 }
 
 int DVDOpen(const char *path, DVDFileInfo *file) {

