tools/mutations/dvd_read_async_skip_busy.patch
diff --git a/src/sdk_port/dvd/DVD.c b/src/sdk_port/dvd/DVD.c
--- a/src/sdk_port/dvd/DVD.c
+++ b/src/sdk_port/dvd/DVD.c
@@ -145,9 +145,8 @@
     if (!file || !addr) return 0;

     // Mark "busy", do the copy immediately, then mark idle.
-    file->cb.state = 1;
     int n = DVDRead(file, addr, (int)len, (int)offset);
-    file->cb.state = 0;
+    // MUTANT: skip setting command block state transitions (busy -> idle)

     if (cb) {
         cb((n < 0) ? (s32)-1 : (s32)n, file);
