tools/mutations/exi_getid_always_fail.patch
diff --git a/src/sdk_port/exi/EXI.c b/src/sdk_port/exi/EXI.c
--- a/src/sdk_port/exi/EXI.c
+++ b/src/sdk_port/exi/EXI.c
@@ -280,9 +280,6 @@ s32 EXIGetID(s32 channel, u32 device, u32* id) {
   (void)device;
   if (channel < 0 || channel >= MAX_CHAN) return 0;
-  if (!gc_exi_getid_ok[channel]) {
-    if (id) *id = 0;
-    return 0;
-  }
-  if (id) *id = gc_exi_id[channel];
-  return 1;
+  // MUTANT: break GetID; higher-level tests must detect missing IDs.
+  if (id) *id = 0;
+  return 0;
 }
