tools/mutations/gx_enable_tex_offsets_swap_bits.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -831,7 +831,7 @@
 void GXEnableTexOffsets(u32 coord, u8 line_enable, u8 point_enable) {
     // GXGeometry.c: suTs0[coord].line=bit18, point=bit19; bpSentNot=0
     if (coord >= 8) return;
-    gc_gx_su_ts0[coord] = set_field(gc_gx_su_ts0[coord], 1, 18, (u32)(line_enable != 0));
+    gc_gx_su_ts0[coord] = set_field(gc_gx_su_ts0[coord], 1, 19, (u32)(line_enable != 0)); // MUTANT
     gc_gx_su_ts0[coord] = set_field(gc_gx_su_ts0[coord], 1, 19, (u32)(point_enable != 0));
     gc_gx_bp_sent_not = 0;
 }
