tools/mutations/gx_init_tex_obj_ci_keep_ci_flag.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
index bdef922..f9b669f 100644
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -1528,7 +1528,7 @@ void GXLoadTexObj(GXTexObj *obj, u32 id) {
 void GXInitTexObjCI(GXTexObj *obj, void *image_ptr, u16 width, u16 height, u32 format, u32 wrap_s, u32 wrap_t, u8 mipmap, u32 tlut_name) {
     // Mirror GXTexture.c:GXInitTexObjCI: call GXInitTexObj, clear CI flag, set tlutName.
     GXInitTexObj(obj, image_ptr, width, height, format, wrap_s, wrap_t, mipmap);
-    obj->flags &= ~2u;
+    obj->flags |= 2u;
     obj->tlutName = tlut_name;
 }
 
