tools/mutations/gx_normal_3s16_drop_sign.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2545,7 +2545,7 @@ void GXNormal1x16(u16 index) {
 }
 
 void GXNormal3s16(s16 x, s16 y, s16 z) {
-    gc_gx_normal3s16_x = (u32)(s32)x;
+    gc_gx_normal3s16_x = (u32)(u16)x;
     gc_gx_normal3s16_y = (u32)(s32)y;
     gc_gx_normal3s16_z = (u32)(s32)z;
 }
