tools/mutations/gx_poke_dither_negate.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -1147,7 +1147,7 @@
 }
 
 void GXPokeDither(u8 enable) {
-    gc_gx_poke_dither_enable = (u32)enable;
+    gc_gx_poke_dither_enable = (u32)!enable; // MUTANT
 }
 
 void GXPokeBlendMode(u32 type, u32 src_factor, u32 dst_factor, u32 op) {
