tools/mutations/gx_set_alpha_update_wrong_bit.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2040,7 +2040,7 @@
 
 void GXSetAlphaUpdate(u8 update_enable) {
     // GXPixel.c: cmode0 bit 4.
-    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 4, (u32)(update_enable != 0));
+    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 3, (u32)(update_enable != 0)); // MUTANT
     gx_write_ras_reg(gc_gx_cmode0);
     gc_gx_bp_sent_not = 0;
 }
