tools/mutations/gx_set_color_update_wrong_bit.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -1797,7 +1797,7 @@
 void GXSetColorUpdate(u8 enable) {
     gc_gx_color_update_enable = (u32)enable;
     // Mirror GXPixel.c: cmode0 bit 3.
-    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 3, (u32)enable);
+    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 2, (u32)enable); // MUTANT
     gx_write_ras_reg(gc_gx_cmode0);
     gc_gx_bp_sent_not = 0;
 }
