tools/mutations/gx_set_dither_wrong_bit.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2054,7 +2054,7 @@
 
 void GXSetDither(u8 dither) {
     // GXPixel.c: cmode0 bit 2.
-    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 2, (u32)(dither != 0));
+    gc_gx_cmode0 = set_field(gc_gx_cmode0, 1, 3, (u32)(dither != 0)); // MUTANT
     gx_write_ras_reg(gc_gx_cmode0);
     gc_gx_bp_sent_not = 0;
 }
