tools/mutations/gx_set_gp_metric_swap.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2060,7 +2060,7 @@
 }
 
 void GXSetGPMetric(u32 perf0, u32 perf1) {
-    gc_gx_gp_perf0 = perf0;
+    gc_gx_gp_perf0 = perf1; // MUTANT
     gc_gx_gp_perf1 = perf1;
 }
 
