tools/mutations/gx_set_point_size_wrong_shift.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -823,7 +823,7 @@
 
 void GXSetPointSize(u8 pointSize, u32 texOffsets) {
     // GXGeometry.c: lpSize[8..15]=pointSize, lpSize[19..21]=texOffsets; bpSentNot=0
-    gc_gx_lp_size = set_field(gc_gx_lp_size, 8, 8, (u32)pointSize);
+    gc_gx_lp_size = set_field(gc_gx_lp_size, 8, 0, (u32)pointSize); // MUTANT
     gc_gx_lp_size = set_field(gc_gx_lp_size, 3, 19, texOffsets & 0x7u);
     gc_gx_bp_sent_not = 0;
 }
