tools/mutations/gx_set_projection_swap_type.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -1762,7 +1762,7 @@
     f32 p1;
     f32 p3;
     if (type == GX_ORTHOGRAPHIC) {
-        p1 = mtx[0][3];
+        p1 = mtx[0][2]; // MUTANT
         p3 = mtx[1][3];
     } else {
         p1 = mtx[0][2];
