tools/mutations/gx_set_scissor_wrong_offset.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -783,7 +783,7 @@
 }
 
 void GXSetScissor(u32 left, u32 top, u32 wd, u32 ht) {
-    u32 tp = top + 342u;
+    u32 tp = top + 341u; // MUTANT
     u32 lf = left + 342u;
     u32 bm = tp + ht - 1u;
     u32 rt = lf + wd - 1u;
