tools/mutations/gx_set_tev_swap_mode_table_wrong_green_shift.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
index bdef922..c6fe955 100644
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2740,7 +2740,7 @@ void GXSetTevSwapModeTable(u32 table, u32 red, u32 green, u32 blue, u32 alpha) {
     u32 idx0 = table * 2u;
     u32 idx1 = table * 2u + 1u;
     gc_gx_tev_ksel[idx0] = set_field(gc_gx_tev_ksel[idx0], 2, 0, red);
-    gc_gx_tev_ksel[idx0] = set_field(gc_gx_tev_ksel[idx0], 2, 2, green);
+    gc_gx_tev_ksel[idx0] = set_field(gc_gx_tev_ksel[idx0], 2, 4, green);
     gc_sdk_state_store_u32_mirror(
         GC_SDK_OFF_GX_TEV_KSEL_BASE + idx0 * 4u,
         &gc_gx_tev_ksel[idx0], gc_gx_tev_ksel[idx0]);
