tools/mutations/gx_set_vtx_attr_fmt_wrong_dirty.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2268,7 +2268,7 @@
     u32 *vb = &gc_gx_vat_b[vtxfmt];
     u32 *vc = &gc_gx_vat_c[vtxfmt];
     gc_gx_set_vat(va, vb, vc, attr, cnt, type, frac);
-    gc_gx_dirty_state |= 0x10u;
+    gc_gx_dirty_state |= 0x08u; // MUTANT
     gc_gx_dirty_vat |= (u32)(1u << (u8)vtxfmt);
 }
 
