tools/mutations/gx_tex_coord_1x16_truncate.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2551,7 +2551,7 @@ void GXNormal3s16(s16 x, s16 y, s16 z) {
 }
 
 void GXTexCoord1x16(u16 index) {
-    gc_gx_texcoord1x16_last = (u32)index;
+    gc_gx_texcoord1x16_last = (u32)((u8)index);
 }
 
 void GXTexCoord2s16(s16 s, s16 t) {
