tools/mutations/gx_tex_coord_2s16_drop_sign.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
index bdef922..556e7a4 100644
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -2553,7 +2553,7 @@ void GXTexCoord1x16(u16 index) {
 }
 
 void GXTexCoord2s16(s16 s, s16 t) {
-    gc_gx_texcoord2s16_s = (u32)(s32)s;
+    gc_gx_texcoord2s16_s = (u32)(u16)s;
     gc_gx_texcoord2s16_t = (u32)(s32)t;
 }
 
