tools/mutations/gx_wait_draw_done_wrong_flag.patch
diff --git a/src/sdk_port/gx/GX.c b/src/sdk_port/gx/GX.c
--- a/src/sdk_port/gx/GX.c
+++ b/src/sdk_port/gx/GX.c
@@ -1641,7 +1641,7 @@
 void GXWaitDrawDone(void) {
     // Deterministic completion: don't block, just mark "done".
     gc_gx_wait_draw_done_calls++;
-    gc_gx_draw_done_flag = 1;
+    gc_gx_draw_done_flag = 0; // MUTANT
 }
 
 typedef float f32;
