tools/mutations/mtx_identity_wrong_diagonal.patch
diff --git a/src/sdk_port/mtx/mtx.c b/src/sdk_port/mtx/mtx.c
--- a/src/sdk_port/mtx/mtx.c
+++ b/src/sdk_port/mtx/mtx.c
@@ -20,5 +20,5 @@
     mtx[2][0] = 0.0f;
     mtx[2][1] = 0.0f;
-    mtx[2][2] = 1.0f;
+    mtx[2][2] = 0.0f; // MUTANT: zero instead of 1.0 on [2][2] diagonal
     mtx[2][3] = 0.0f;
 }
