tools/mutations/mtx_identity_wrong_diagonal.patch
diff --git a/src/sdk_port/mtx/mtx.c b/src/sdk_port/mtx/mtx.c
index bf5935d..1860dc7 100644
--- a/src/sdk_port/mtx/mtx.c
+++ b/src/sdk_port/mtx/mtx.c
@@ -16,7 +16,7 @@ void C_MTXIdentity(Mtx mtx)
 {
     mtx[0][0] = 1.0f; mtx[0][1] = 0.0f; mtx[0][2] = 0.0f; mtx[0][3] = 0.0f;
     mtx[1][0] = 0.0f; mtx[1][1] = 1.0f; mtx[1][2] = 0.0f; mtx[1][3] = 0.0f;
-    mtx[2][0] = 0.0f; mtx[2][1] = 0.0f; mtx[2][2] = 1.0f; mtx[2][3] = 0.0f;
+    mtx[2][0] = 0.0f; mtx[2][1] = 0.0f; mtx[2][2] = 0.0f; // MUTANT mtx[2][3] = 0.0f;
 }
 
 /* Paired-single variant aliases to the same observable output. */
