tools/mutations/os_dc_store_range_no_sync_zero_len.patch
diff --git a/src/sdk_port/os/OSCache.c b/src/sdk_port/os/OSCache.c
--- a/src/sdk_port/os/OSCache.c
+++ b/src/sdk_port/os/OSCache.c
@@ -19,4 +19,5 @@
 __attribute__((weak)) void DCStoreRangeNoSync(void *addr, uint32_t nbytes) {
     gc_dc_store_last_addr = (uint32_t)(uintptr_t)addr;
-    gc_dc_store_last_len = nbytes;
+    // MUTANT: zero out the stored length
+    gc_dc_store_last_len = 0;
 }
