tools/mutations/os_get_console_simulated_mem_size_wrong_value.patch
diff --git a/src/sdk_port/os/OSSystem.c b/src/sdk_port/os/OSSystem.c
--- a/src/sdk_port/os/OSSystem.c
+++ b/src/sdk_port/os/OSSystem.c
@@ -17,3 +17,4 @@
 uint32_t OSGetConsoleSimulatedMemSize(void) {
-    return 0x01800000u;
+    // MUTANT: return wrong memory size (half)
+    return 0x00C00000u;
 }
