tools/mutations/os_lock_sram_ex_reentrant_lock_allowed.patch
diff --git a/src/sdk_port/os/OSRtc.c b/src/sdk_port/os/OSRtc.c
--- a/src/sdk_port/os/OSRtc.c
+++ b/src/sdk_port/os/OSRtc.c
@@ -99,7 +99,7 @@ static void* LockSram(u32 offset) {
     BOOL enabled = OSDisableInterrupts();
 
-    if (Scb.locked != FALSE) {
+    if (Scb.locked == FALSE) {
         OSRestoreInterrupts(enabled);
         update_mirrors();
         return NULL;
     }
