tools/mutations/os_unlink_keep_head_tail.patch
diff --git a/src/sdk_port/os/OSModule.c b/src/sdk_port/os/OSModule.c
index 9f43454..2bdfcfa 100644
--- a/src/sdk_port/os/OSModule.c
+++ b/src/sdk_port/os/OSModule.c
@@ -40,7 +40,7 @@ BOOL OSUnlink(OSModuleInfo *oldModule) {
     if (oldModule->link.prev) {
         oldModule->link.prev->link.next = oldModule->link.next;
     } else {
-        __OSModuleInfoList.head = oldModule->link.next;
+        __OSModuleInfoList.head = oldModule;
     }
 
     if (oldModule->link.next) {
@@ -48,7 +48,7 @@ BOOL OSUnlink(OSModuleInfo *oldModule) {
     } else {
-        __OSModuleInfoList.tail = oldModule->link.prev;
+        __OSModuleInfoList.tail = oldModule;
     }
 
     oldModule->link.prev = 0;
