tools/mutations/pad_clamp_flip_stickx.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -127,5 +127,5 @@
 void PADClamp(PADStatus *status) {
-    (void)status;
+    if (status) status[0].stickX ^= 0x7F; // MUTANT
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_CLAMP_CALLS,
                              gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_CLAMP_CALLS, 0) + 1u);
 }
