tools/mutations/pad_clamp_skip_call_counter.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
index 6dc3488..59db682 100644
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -221,7 +221,7 @@ void PADClamp(PADStatus *status) {
         }
     }
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_CLAMP_CALLS,
-                             gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_CLAMP_CALLS, 0) + 1u);
+                             gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_CLAMP_CALLS, 0));
 }
 
 BOOL PADReset(u32 mask) {
