tools/mutations/pad_init_skip_reset_internal.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
index 6dc3488..1083195 100644
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -299,5 +299,6 @@ BOOL PADInit(void) {
     PAD_SIRefreshSamplingRate();
     OSRegisterResetFunction(0);
 
-    return PADResetInternal(PAD_CHAN0_BIT | PAD_CHAN1_BIT | PAD_CHAN2_BIT | PAD_CHAN3_BIT);
+    return TRUE;
+    /* mutant: skipped PADResetInternal */
 }
