tools/mutations/pad_read_return_zero.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
index 3a6bb3e..1c3b3e1 100644
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -104,6 +104,7 @@
 u32 PADRead(PADStatus *status) {
+    // MUTANT: return 0 (pretend no controllers are present).
     // Deterministic stub for MP4 init:
     // Retail trace shows chan0 present+idle (err=0) and chans 1..3 absent (err=-1),
     // and return value PAD_CHAN0_BIT (0x80000000).
@@ -121,5 +122,5 @@ u32 PADRead(PADStatus *status) {
     }
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_READ_CALLS,
                              gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_READ_CALLS, 0) + 1u);
-    return PAD_CHAN0_BIT;
+    return 0;
 }
