tools/mutations/pad_read_return_zero.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -122,4 +122,4 @@
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_READ_CALLS,
                              gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_READ_CALLS, 0) + 1u);
-    return PAD_CHAN0_BIT;
+    return 0; // MUTANT
 }
