tools/mutations/pad_recalibrate_zero_bits.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -165,6 +165,6 @@

 BOOL PADRecalibrate(u32 mask) {
-    RecalibrateBits = mask;
+    RecalibrateBits = 0; // MUTANT: zero out recalibrate bits instead of storing mask
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RECALIBRATE_MASK, mask);
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RECALIBRATE_CALLS,
                              gc_sdk_state_load_u32_or(GC_SDK_OFF_PAD_RECALIBRATE_CALLS, 0) + 1u);
