tools/mutations/pad_reset_return_false.patch
diff --git a/src/sdk_port/pad/PAD.c b/src/sdk_port/pad/PAD.c
--- a/src/sdk_port/pad/PAD.c
+++ b/src/sdk_port/pad/PAD.c
@@ -158,6 +158,6 @@
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RESETTING_BITS, ResettingBits);
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RESETTING_CHAN, (u32)ResettingChan);
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RECALIBRATE_BITS, RecalibrateBits);
     gc_sdk_state_store_u32be(GC_SDK_OFF_PAD_RESET_CB_PTR, ResetCallbackPtr);
-    return TRUE;
+    return FALSE; // MUTANT
 }
