tools/mutations/vi_set_post_retrace_callback_drop_ptr.patch
diff --git a/src/sdk_port/vi/VI.c b/src/sdk_port/vi/VI.c
index 8f9c6a2..4d6d3b1 100644
--- a/src/sdk_port/vi/VI.c
+++ b/src/sdk_port/vi/VI.c
@@ -80,9 +80,9 @@ VIRetraceCallback VISetPostRetraceCallback(VIRetraceCallback callback) {
 
     // Match SDK pattern: protect callback swap with interrupts disabled.
     int lvl = VI_DisableInterrupts();
     gc_vi_post_cb_fn = callback;
-    gc_vi_post_cb_ptr = vi_cb_tokenize(callback);
+    gc_vi_post_cb_ptr = 0; // MUTANT: drop the callback pointer token.
     gc_sdk_state_store_u32_mirror(GC_SDK_OFF_VI_POST_CB_PTR, &gc_vi_post_cb_ptr, gc_vi_post_cb_ptr);
     u32 calls = gc_sdk_state_load_u32_or(GC_SDK_OFF_VI_POST_CB_SET_CALLS, 0);
     calls++;
*** End Patch"}]}Oops tool call invalid: '{"*** Begin Patch\n*** Add File: tools/mutations/vi_set_post_retrace_callback_drop_ptr.patch\n+diff --git a/src/sdk_port/vi/VI.c b/src/sdk_port/vi/VI.c\n+index 8f9c6a2..4d6d3b1 100644\n+--- a/src/sdk_port/vi/VI.c\n++++ b/src/sdk_port/vi/VI.c\n+@@ -80,9 +80,9 @@ VIRetraceCallback VISetPostRetraceCallback(VIRetraceCallback callback) {\n+ \n+     // Match SDK pattern: protect callback swap with interrupts disabled.\n+     int lvl = VI_DisableInterrupts();\n+     gc_vi_post_cb_fn = callback;\n+-    gc_vi_post_cb_ptr = vi_cb_tokenize(callback);\n++    gc_vi_post_cb_ptr = 0; // MUTANT: drop the callback pointer token.\n+     gc_sdk_state_store_u32_mirror(GC_SDK_OFF_VI_POST_CB_PTR, &gc_vi_post_cb_ptr, gc_vi_post_cb_ptr);\n+     u32 calls = gc_sdk_state_load_u32_or(GC_SDK_OFF_VI_POST_CB_SET_CALLS, 0);\n+     calls++;\n+*** End Patch"}' is not valid JSON.  Let me check that all required parameters are provided.  The value must be a string not a dictionary. (error_code: invalid_json)??? Looks like the tool expects a plain string input. We'll use apply_patch correctly. We'll continue. In analysis: apply_patch expects freeform string, not JSON. We'll call tool accordingly. Let's do.``` We'll fix. We'll create vi mutation patch and wrapper. Also chmod scripts. Need to correct previous mistake: now. We'll proceed with correct apply_patch usage. Also we must ensure patch applies: need correct index lines; may differ; we can omit index? but needed. Should use correct current blob hash. To avoid, we can make patch without index lines? git apply accepts patch without index? It might, but easiest create patch with minimal header: diff --git, ---/+++, @@ with context; no index line required? It is optional. But our runner uses git apply; it will accept no index. Let's avoid index to reduce fragility. But our earlier patches include index; they may break if blob hash changes in future. It's ok; but now perhaps consistent. We'll keep with no index for new ones? That inconsistency ok; but patch file for run_mutation_check uses git apply; index line not required. Let's remove index lines for all? Too much. Keep as is for now. For VI.c we need correct index hash but we can compute via git hash-object? Better to avoid. We'll create patch without index. Let's do patch file with diff --git and then ---/+++. We'll apply_patch and then test mutation wrapper. We'll also add wrapper script vi_set_post_retrace_callback_drop_ptr.sh.
